/*
 Напишите функцию, с переменным количеством аргументов,
 которая в качестве обязательного параметра принимает
 тип действия и количество переменных и выполняет выбранное действие
  над этими переменными. «+» - сложение,
   «*» - умножение, «s» - среднее арифметическое.
Например:
double R = calc(‘s’,5,3,4,5,3,7);
cout<<R;
На экране мы увидим 4.4.
 */

#include <iostream>
#include<stdio.h>
#include<stdlib.h>
#include<ctime>
using namespace std;



int main(void) {

	return 0;
}


